In [2]:
import numpy as np
import pandas as pd 
import seaborn as sns

In [5]:
df=sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
df.age.mean()

29.69911764705882

In [7]:
df.age.mode()

0    24.0
Name: age, dtype: float64

In [8]:
round((df.isna().sum()/df.shape[0])*100,2) # to know the percentage of null value in the particular column

survived        0.00
pclass          0.00
sex             0.00
age            19.87
sibsp           0.00
parch           0.00
fare            0.00
embarked        0.22
class           0.00
who             0.00
adult_male      0.00
deck           77.22
embark_town     0.22
alive           0.00
alone           0.00
dtype: float64

# Imputing Missing Values

1. Mean or Average

2. Median.

In [9]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [10]:
df.age.fillna(df.age.median(), inplace=True)

In [11]:
df.isna().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [16]:
df.drop(columns=["deck"],inplace=True)

In [17]:
df.embark_town.fillna(df.embark_town.mode()[0],inplace=True)

In [18]:
df.isna().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [19]:
df.embarked .fillna(df.embarked.mode()[0],inplace=True)

In [20]:
df.isna().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [21]:
len(df[df["who"]=="child"]["sex"])

83

In [22]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [23]:
df[df["alone"]==True][["sibsp","parch"]]

     sibsp  parch
2        0      0
4        0      0
5        0      0
6        0      0
11       0      0
..     ...    ...
884      0      0
886      0      0
887      0      0
889      0      0
890      0      0

[537 rows x 2 columns]

In [25]:
df.drop(columns = ["class","embarked","adult_male","alive","alone"],inplace  = True)

In [26]:
df

     survived  pclass     sex   age  sibsp  parch     fare    who  embark_town
0           0       3    male  22.0      1      0   7.2500    man  Southampton
1           1       1  female  38.0      1      0  71.2833  woman    Cherbourg
2           1       3  female  26.0      0      0   7.9250  woman  Southampton
3           1       1  female  35.0      1      0  53.1000  woman  Southampton
4           0       3    male  35.0      0      0   8.0500    man  Southampton
..        ...     ...     ...   ...    ...    ...      ...    ...          ...
886         0       2    male  27.0      0      0  13.0000    man  Southampton
887         1       1  female  19.0      0      0  30.0000  woman  Southampton
888         0       3  female  28.0      1      2  23.4500  woman  Southampton
889         1       1    male  26.0      0      0  30.0000    man    Cherbourg
890         0       3    male  32.0      0      0   7.7500    man   Queenstown

[891 rows x 9 columns]

In [27]:
df.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64